modules/gateway/gateway-api/src/test/resources/com/l7tech/gateway/api/testMessages/Service_GetWsdl_Response.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:l7="http://ns.l7tech.com/2010/01/gateway-management" xmlns:mdo="http://schemas.wiseman.dev.java.net/metadata/messagetypes" xmlns:mex="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wsmeta="http://schemas.dmtf.org/wbem/wsman/1/wsman/version1.0.0.a/default-addressing-model.xsd" xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:xs="http://www.w3.org/2001/XMLSchema"><env:Header><wsa:Action xmlns:ns11="http://ns.l7tech.com/2010/01/gateway-management" env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</wsa:Action><wsman:FragmentTransfer Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116" env:mustUnderstand="true" xmlns:l7="http://ns.l7tech.com/2010/01/gateway-management">l7:Resources/l7:ResourceSet[@tag='wsdl']</wsman:FragmentTransfer><wsa:MessageID env:mustUnderstand="true">uuid:2b35210a-3024-4fac-89c3-a127b2bc223d</wsa:MessageID><wsa:RelatesTo>uuid:ec150c0b-102c-479b-967a-351fcf7b2597</wsa:RelatesTo><wsa:To env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To></env:Header><env:Body xmlns:ns9="http://ns.l7tech.com/2010/01/gateway-management"><wsman:XmlFragment><ns9:ResourceSet rootUrl="http://hugh.l7tech.com/ACMEWarehouseWS/Service1.asmx?wsdl" tag="wsdl" xmlns=""><ns9:Resource sourceUrl="http://hugh.l7tech.com/ACMEWarehouseWS/Service1.asmx?wsdl" type="wsdl">&lt;wsdl:definitions xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:tns="http://warehouse.acme.com/ws" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://warehouse.acme.com/ws"&gt;
  &lt;wsdl:types&gt;
    &lt;s:schema elementFormDefault="qualified" targetNamespace="http://warehouse.acme.com/ws"&gt;
      &lt;s:element name="listProducts"&gt;
        &lt;s:complexType&gt;
          &lt;s:sequence&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="delay" type="s:int"&gt;&lt;/s:element&gt;
          &lt;/s:sequence&gt;
        &lt;/s:complexType&gt;
      &lt;/s:element&gt;
      &lt;s:element name="listProductsResponse"&gt;
        &lt;s:complexType&gt;
          &lt;s:sequence&gt;
            &lt;s:element maxOccurs="1" minOccurs="0" name="listProductsResult" type="tns:ArrayOfProductListHeader"&gt;&lt;/s:element&gt;
          &lt;/s:sequence&gt;
        &lt;/s:complexType&gt;
      &lt;/s:element&gt;
      &lt;s:complexType name="ArrayOfProductListHeader"&gt;
        &lt;s:sequence&gt;
          &lt;s:element maxOccurs="unbounded" minOccurs="0" name="ProductListHeader" nillable="true" type="tns:ProductListHeader"&gt;&lt;/s:element&gt;
        &lt;/s:sequence&gt;
      &lt;/s:complexType&gt;
      &lt;s:complexType name="ProductListHeader"&gt;
        &lt;s:sequence&gt;
          &lt;s:element maxOccurs="1" minOccurs="0" name="productName" type="s:string"&gt;&lt;/s:element&gt;
          &lt;s:element maxOccurs="1" minOccurs="1" name="productId" type="s:long"&gt;&lt;/s:element&gt;
        &lt;/s:sequence&gt;
      &lt;/s:complexType&gt;
      &lt;s:element name="getProductDetails"&gt;
        &lt;s:complexType&gt;
          &lt;s:sequence&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="productid" type="s:long"&gt;&lt;/s:element&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="delay" type="s:int"&gt;&lt;/s:element&gt;
          &lt;/s:sequence&gt;
        &lt;/s:complexType&gt;
      &lt;/s:element&gt;
      &lt;s:element name="getProductDetailsResponse"&gt;
        &lt;s:complexType&gt;
          &lt;s:sequence&gt;
            &lt;s:element maxOccurs="1" minOccurs="0" name="getProductDetailsResult" type="tns:ProductDetails"&gt;&lt;/s:element&gt;
          &lt;/s:sequence&gt;
        &lt;/s:complexType&gt;
      &lt;/s:element&gt;
      &lt;s:complexType name="ProductDetails"&gt;
        &lt;s:complexContent mixed="false"&gt;
          &lt;s:extension base="tns:ProductListHeader"&gt;
            &lt;s:sequence&gt;
              &lt;s:element maxOccurs="1" minOccurs="0" name="description" type="s:string"&gt;&lt;/s:element&gt;
              &lt;s:element maxOccurs="1" minOccurs="1" name="price" type="s:float"&gt;&lt;/s:element&gt;
              &lt;s:element maxOccurs="1" minOccurs="1" name="inStock" type="s:boolean"&gt;&lt;/s:element&gt;
            &lt;/s:sequence&gt;
          &lt;/s:extension&gt;
        &lt;/s:complexContent&gt;
      &lt;/s:complexType&gt;
      &lt;s:element name="placeOrder"&gt;
        &lt;s:complexType&gt;
          &lt;s:sequence&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="productid" type="s:long"&gt;&lt;/s:element&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="amount" type="s:long"&gt;&lt;/s:element&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="price" type="s:float"&gt;&lt;/s:element&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="accountid" type="s:long"&gt;&lt;/s:element&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="delay" type="s:int"&gt;&lt;/s:element&gt;
          &lt;/s:sequence&gt;
        &lt;/s:complexType&gt;
      &lt;/s:element&gt;
      &lt;s:element name="placeOrderResponse"&gt;
        &lt;s:complexType&gt;
          &lt;s:sequence&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="placeOrderResult" type="s:long"&gt;&lt;/s:element&gt;
          &lt;/s:sequence&gt;
        &lt;/s:complexType&gt;
      &lt;/s:element&gt;
      &lt;s:element name="currentOrders"&gt;
        &lt;s:complexType&gt;
          &lt;s:sequence&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="accountid" type="s:long"&gt;&lt;/s:element&gt;
            &lt;s:element maxOccurs="1" minOccurs="1" name="delay" type="s:int"&gt;&lt;/s:element&gt;
          &lt;/s:sequence&gt;
        &lt;/s:complexType&gt;
      &lt;/s:element&gt;
      &lt;s:element name="currentOrdersResponse"&gt;
        &lt;s:complexType&gt;
          &lt;s:sequence&gt;
            &lt;s:element maxOccurs="1" minOccurs="0" name="currentOrdersResult" type="tns:ArrayOfOrder"&gt;&lt;/s:element&gt;
          &lt;/s:sequence&gt;
        &lt;/s:complexType&gt;
      &lt;/s:element&gt;
      &lt;s:complexType name="ArrayOfOrder"&gt;
        &lt;s:sequence&gt;
          &lt;s:element maxOccurs="unbounded" minOccurs="0" name="Order" nillable="true" type="tns:Order"&gt;&lt;/s:element&gt;
        &lt;/s:sequence&gt;
      &lt;/s:complexType&gt;
      &lt;s:complexType name="Order"&gt;
        &lt;s:sequence&gt;
          &lt;s:element maxOccurs="1" minOccurs="1" name="date" type="s:dateTime"&gt;&lt;/s:element&gt;
          &lt;s:element maxOccurs="1" minOccurs="1" name="accountId" type="s:long"&gt;&lt;/s:element&gt;
          &lt;s:element maxOccurs="1" minOccurs="1" name="productId" type="s:long"&gt;&lt;/s:element&gt;
          &lt;s:element maxOccurs="1" minOccurs="1" name="amount" type="s:long"&gt;&lt;/s:element&gt;
          &lt;s:element maxOccurs="1" minOccurs="1" name="price" type="s:float"&gt;&lt;/s:element&gt;
          &lt;s:element maxOccurs="1" minOccurs="1" name="confirmationId" type="s:long"&gt;&lt;/s:element&gt;
        &lt;/s:sequence&gt;
      &lt;/s:complexType&gt;
    &lt;/s:schema&gt;
  &lt;/wsdl:types&gt;
  &lt;wsdl:message name="listProductsSoapIn"&gt;
    &lt;wsdl:part element="tns:listProducts" name="parameters"&gt;&lt;/wsdl:part&gt;
  &lt;/wsdl:message&gt;
  &lt;wsdl:message name="listProductsSoapOut"&gt;
    &lt;wsdl:part element="tns:listProductsResponse" name="parameters"&gt;&lt;/wsdl:part&gt;
  &lt;/wsdl:message&gt;
  &lt;wsdl:message name="getProductDetailsSoapIn"&gt;
    &lt;wsdl:part element="tns:getProductDetails" name="parameters"&gt;&lt;/wsdl:part&gt;
  &lt;/wsdl:message&gt;
  &lt;wsdl:message name="getProductDetailsSoapOut"&gt;
    &lt;wsdl:part element="tns:getProductDetailsResponse" name="parameters"&gt;&lt;/wsdl:part&gt;
  &lt;/wsdl:message&gt;
  &lt;wsdl:message name="placeOrderSoapIn"&gt;
    &lt;wsdl:part element="tns:placeOrder" name="parameters"&gt;&lt;/wsdl:part&gt;
  &lt;/wsdl:message&gt;
  &lt;wsdl:message name="placeOrderSoapOut"&gt;
    &lt;wsdl:part element="tns:placeOrderResponse" name="parameters"&gt;&lt;/wsdl:part&gt;
  &lt;/wsdl:message&gt;
  &lt;wsdl:message name="currentOrdersSoapIn"&gt;
    &lt;wsdl:part element="tns:currentOrders" name="parameters"&gt;&lt;/wsdl:part&gt;
  &lt;/wsdl:message&gt;
  &lt;wsdl:message name="currentOrdersSoapOut"&gt;
    &lt;wsdl:part element="tns:currentOrdersResponse" name="parameters"&gt;&lt;/wsdl:part&gt;
  &lt;/wsdl:message&gt;
  &lt;wsdl:portType name="WarehouseSoap"&gt;
    &lt;wsdl:operation name="listProducts"&gt;
      &lt;wsdl:input message="tns:listProductsSoapIn"&gt;&lt;/wsdl:input&gt;
      &lt;wsdl:output message="tns:listProductsSoapOut"&gt;&lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
    &lt;wsdl:operation name="getProductDetails"&gt;
      &lt;wsdl:input message="tns:getProductDetailsSoapIn"&gt;&lt;/wsdl:input&gt;
      &lt;wsdl:output message="tns:getProductDetailsSoapOut"&gt;&lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
    &lt;wsdl:operation name="placeOrder"&gt;
      &lt;wsdl:input message="tns:placeOrderSoapIn"&gt;&lt;/wsdl:input&gt;
      &lt;wsdl:output message="tns:placeOrderSoapOut"&gt;&lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
    &lt;wsdl:operation name="currentOrders"&gt;
      &lt;wsdl:input message="tns:currentOrdersSoapIn"&gt;&lt;/wsdl:input&gt;
      &lt;wsdl:output message="tns:currentOrdersSoapOut"&gt;&lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
  &lt;/wsdl:portType&gt;
  &lt;wsdl:binding name="WarehouseSoap" type="tns:WarehouseSoap"&gt;
    &lt;soap:binding transport="http://schemas.xmlsoap.org/soap/http"&gt;&lt;/soap:binding&gt;
    &lt;wsdl:operation name="listProducts"&gt;
      &lt;soap:operation soapAction="http://warehouse.acme.com/ws/listProducts" style="document"&gt;&lt;/soap:operation&gt;
      &lt;wsdl:input&gt;
        &lt;soap:body use="literal"&gt;&lt;/soap:body&gt;
      &lt;/wsdl:input&gt;
      &lt;wsdl:output&gt;
        &lt;soap:body use="literal"&gt;&lt;/soap:body&gt;
      &lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
    &lt;wsdl:operation name="getProductDetails"&gt;
      &lt;soap:operation soapAction="http://warehouse.acme.com/ws/getProductDetails" style="document"&gt;&lt;/soap:operation&gt;
      &lt;wsdl:input&gt;
        &lt;soap:body use="literal"&gt;&lt;/soap:body&gt;
      &lt;/wsdl:input&gt;
      &lt;wsdl:output&gt;
        &lt;soap:body use="literal"&gt;&lt;/soap:body&gt;
      &lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
    &lt;wsdl:operation name="placeOrder"&gt;
      &lt;soap:operation soapAction="http://warehouse.acme.com/ws/placeOrder" style="document"&gt;&lt;/soap:operation&gt;
      &lt;wsdl:input&gt;
        &lt;soap:body use="literal"&gt;&lt;/soap:body&gt;
      &lt;/wsdl:input&gt;
      &lt;wsdl:output&gt;
        &lt;soap:body use="literal"&gt;&lt;/soap:body&gt;
      &lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
    &lt;wsdl:operation name="currentOrders"&gt;
      &lt;soap:operation soapAction="http://warehouse.acme.com/ws/currentOrders" style="document"&gt;&lt;/soap:operation&gt;
      &lt;wsdl:input&gt;
        &lt;soap:body use="literal"&gt;&lt;/soap:body&gt;
      &lt;/wsdl:input&gt;
      &lt;wsdl:output&gt;
        &lt;soap:body use="literal"&gt;&lt;/soap:body&gt;
      &lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
  &lt;/wsdl:binding&gt;
  &lt;wsdl:binding name="WarehouseSoap12" type="tns:WarehouseSoap"&gt;
    &lt;soap12:binding transport="http://schemas.xmlsoap.org/soap/http"&gt;&lt;/soap12:binding&gt;
    &lt;wsdl:operation name="listProducts"&gt;
      &lt;soap12:operation soapAction="http://warehouse.acme.com/ws/listProducts" style="document"&gt;&lt;/soap12:operation&gt;
      &lt;wsdl:input&gt;
        &lt;soap12:body use="literal"&gt;&lt;/soap12:body&gt;
      &lt;/wsdl:input&gt;
      &lt;wsdl:output&gt;
        &lt;soap12:body use="literal"&gt;&lt;/soap12:body&gt;
      &lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
    &lt;wsdl:operation name="getProductDetails"&gt;
      &lt;soap12:operation soapAction="http://warehouse.acme.com/ws/getProductDetails" style="document"&gt;&lt;/soap12:operation&gt;
      &lt;wsdl:input&gt;
        &lt;soap12:body use="literal"&gt;&lt;/soap12:body&gt;
      &lt;/wsdl:input&gt;
      &lt;wsdl:output&gt;
        &lt;soap12:body use="literal"&gt;&lt;/soap12:body&gt;
      &lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
    &lt;wsdl:operation name="placeOrder"&gt;
      &lt;soap12:operation soapAction="http://warehouse.acme.com/ws/placeOrder" style="document"&gt;&lt;/soap12:operation&gt;
      &lt;wsdl:input&gt;
        &lt;soap12:body use="literal"&gt;&lt;/soap12:body&gt;
      &lt;/wsdl:input&gt;
      &lt;wsdl:output&gt;
        &lt;soap12:body use="literal"&gt;&lt;/soap12:body&gt;
      &lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
    &lt;wsdl:operation name="currentOrders"&gt;
      &lt;soap12:operation soapAction="http://warehouse.acme.com/ws/currentOrders" style="document"&gt;&lt;/soap12:operation&gt;
      &lt;wsdl:input&gt;
        &lt;soap12:body use="literal"&gt;&lt;/soap12:body&gt;
      &lt;/wsdl:input&gt;
      &lt;wsdl:output&gt;
        &lt;soap12:body use="literal"&gt;&lt;/soap12:body&gt;
      &lt;/wsdl:output&gt;
    &lt;/wsdl:operation&gt;
  &lt;/wsdl:binding&gt;
  &lt;wsdl:service name="Warehouse"&gt;
    &lt;wsdl:port binding="tns:WarehouseSoap" name="WarehouseSoap"&gt;
      &lt;soap:address location="http://hugh.l7tech.com/ACMEWarehouseWS/Service1.asmx"&gt;&lt;/soap:address&gt;
    &lt;/wsdl:port&gt;
    &lt;wsdl:port binding="tns:WarehouseSoap12" name="WarehouseSoap12"&gt;
      &lt;soap12:address location="http://hugh.l7tech.com/ACMEWarehouseWS/Service1.asmx"&gt;&lt;/soap12:address&gt;
    &lt;/wsdl:port&gt;
  &lt;/wsdl:service&gt;
&lt;/wsdl:definitions&gt;</ns9:Resource></ns9:ResourceSet></wsman:XmlFragment></env:Body></env:Envelope>